In [1]:
import pandas as pd

In [2]:
obj =pd.Series([5, 4, 9, 4, 3, 8, 1])
print(obj)

0    5
1    4
2    9
3    4
4    3
5    8
6    1
dtype: int64

In [3]:
obj[1]

4

In [4]:
obj[4]=9

In [5]:
obj

0    5
1    4
2    9
3    4
4    9
5    8
6    1
dtype: int64

In [6]:
print(obj.values)

[5 4 9 4 9 8 1]

In [7]:
print(obj.index)

RangeIndex(start=0, stop=7, step=1)

In [8]:
sales = pd.Series([100, 500, 700, 200, 500], index=["Mango", "Apple", "Banana", "Graphes", "peach"] )
print(sales)

Mango      100
Apple      500
Banana     700
Graphes    200
peach      500
dtype: int64

In [9]:
sales["Mango"]

100

In [10]:
sales["Mango"] = 700

In [11]:
sales

Mango      700
Apple      500
Banana     700
Graphes    200
peach      500
dtype: int64

In [12]:
sales["Name"]= "6 Month Sale"

In [13]:
sales

Mango               700
Apple               500
Banana              700
Graphes             200
peach               500
Name       6 Month Sale
dtype: object

In [14]:
weekly = pd.Series([700,400,600,800,100,300,400], index = ["Mon","tues","wed","thurs","fri","sat","Sun"])
print(weekly)

Mon      700
tues     400
wed      600
thurs    800
fri      100
sat      300
Sun      400
dtype: int64

In [15]:
weekly["tues"]

400

In [16]:
weekly[1]

400

In [17]:
weekly[["Mon","wed"]]

Mon    700
wed    600
dtype: int64

In [18]:
weekly[weekly>200]

Mon      700
tues     400
wed      600
thurs    800
sat      300
Sun      400
dtype: int64

In [19]:
weekly[weekly<200]

fri    100
dtype: int64

In [20]:
weekly*2

Mon      1400
tues      800
wed      1200
thurs    1600
fri       200
sat       600
Sun       800
dtype: int64

In [21]:
weekly

Mon      700
tues     400
wed      600
thurs    800
fri      100
sat      300
Sun      400
dtype: int64

In [22]:
weekly = weekly*2

In [23]:
weekly

Mon      1400
tues      800
wed      1200
thurs    1600
fri       200
sat       600
Sun       800
dtype: int64

In [24]:
"Mon" in weekly

True

In [25]:
import numpy as np
ar = np.array([2,5,9,2,3])
ind = np.array(["a","b","c","d","e"])

obj1 = pd.Series(ar, index = ind)
obj1

a    2
b    5
c    9
d    2
e    3
dtype: int32

In [26]:
dic = {"Name":"Waseem","Age":35,"Qulaification":"Gradaute","Status":"Married","Kids":1}
Obj2 = pd.Series(dic)
print(Obj2)

Name               Waseem
Age                    35
Qulaification    Gradaute
Status            Married
Kids                    1
dtype: object

In [27]:
Obj2.values

array(['Waseem', 35, 'Gradaute', 'Married', 1], dtype=object)

In [28]:
Obj2 = pd.Series(dic, index = ["Age","Name","Kids","Qulaification","Status"])
Obj2

Age                    35
Name               Waseem
Kids                    1
Qulaification    Gradaute
Status            Married
dtype: object

In [29]:
dic = {"Name":"Waseem","Age":38,"Qulaification":"B.com","Status":"Married","Kids":1}
Obj2 = pd.Series(dic, index = ["Age","Name","Kids","Qulaification","Status"])
Obj2

Age                   38
Name              Waseem
Kids                   1
Qulaification      B.com
Status           Married
dtype: object

In [30]:
Obj2

Age                   38
Name              Waseem
Kids                   1
Qulaification      B.com
Status           Married
dtype: object

In [31]:
obj1

a    2
b    5
c    9
d    2
e    3
dtype: int32

In [32]:
dic = {"Name":"Waseem","Age":38,"Qulaification":"B.com","Status":"Married","Kids":1}
Obj2 = pd.Series(dic, index = ["Age","Name","Kids","Qulaification","Status","email"])
Obj2

Age                   38
Name              Waseem
Kids                   1
Qulaification      B.com
Status           Married
email                NaN
dtype: object

In [33]:
pd.isnull(Obj2)

Age              False
Name             False
Kids             False
Qulaification    False
Status           False
email             True
dtype: bool

In [34]:
Obj2["email"] = "waseem.m.yaqoob@gmail.com"

In [35]:
Obj2

Age                                     38
Name                                Waseem
Kids                                     1
Qulaification                        B.com
Status                             Married
email            waseem.m.yaqoob@gmail.com
dtype: object

In [36]:
Obj2.index.name = "Person Name"

In [37]:
Obj2

Person Name
Age                                     38
Name                                Waseem
Kids                                     1
Qulaification                        B.com
Status                             Married
email            waseem.m.yaqoob@gmail.com
dtype: object

In [38]:
Obj2 = pd.Series(dic, index = ["Name","Age","Status","Qulaification","Kids","email"])

In [39]:
Obj2

Name              Waseem
Age                   38
Status           Married
Qulaification      B.com
Kids                   1
email                NaN
dtype: object

In [40]:
Obj2.index.name = "Person Information"

In [41]:
Obj2

Person Information
Name              Waseem
Age                   38
Status           Married
Qulaification      B.com
Kids                   1
email                NaN
dtype: object

In [42]:
Obj2["email"]= "waseem.m.yaqoob@gmail.com"

In [43]:
Obj2

Person Information
Name                                Waseem
Age                                     38
Status                             Married
Qulaification                        B.com
Kids                                     1
email            waseem.m.yaqoob@gmail.com
dtype: object

In [44]:
apple = pd.Series([2,4,6,7,8])
orange = pd.Series([4,5,6,1,2])
print(apple,orange)

0    2
1    4
2    6
3    7
4    8
dtype: int64 0    4
1    5
2    6
3    1
4    2
dtype: int64

In [45]:
dic2 = {"apples":apple,"Oranges":orange}
fruit = pd.DataFrame(dic2)

In [46]:
fruit

   apples  Oranges
0       2        4
1       4        5
2       6        6
3       7        1
4       8        2

In [47]:
Year = [2000,2004,2010,2013,2019]
Passes = ["Matric","Inter","B.com","English Learning","A.I"]
Grade = ["c","B","second Division","Intermediate","Progress"]
Result ={"Year":Year, "Passes":Passes, "Grade":Grade}
Data_person = pd.DataFrame(Result)
print(Data_person)

   Year            Passes            Grade
0  2000            Matric                c
1  2004             Inter                B
2  2010             B.com  second Division
3  2013  English Learning     Intermediate
4  2019               A.I         Progress

In [48]:
Data_person.index= ["1st","2nd","3rd","4th","5th"]

In [49]:
Data_person

     Year            Passes            Grade
1st  2000            Matric                c
2nd  2004             Inter                B
3rd  2010             B.com  second Division
4th  2013  English Learning     Intermediate
5th  2019               A.I         Progress

In [50]:
Data_person.head()

     Year            Passes            Grade
1st  2000            Matric                c
2nd  2004             Inter                B
3rd  2010             B.com  second Division
4th  2013  English Learning     Intermediate
5th  2019               A.I         Progress

In [51]:
Data_person = pd.DataFrame(Result, columns = ["Passes","Grade","Year"])

In [52]:
Data_person

             Passes            Grade  Year
0            Matric                c  2000
1             Inter                B  2004
2             B.com  second Division  2010
3  English Learning     Intermediate  2013
4               A.I         Progress  2019

In [53]:
Data_person=pd.DataFrame(Result, columns = ["Passes","Grade","Year","Number"])

In [54]:
Data_person

             Passes            Grade  Year Number
0            Matric                c  2000    NaN
1             Inter                B  2004    NaN
2             B.com  second Division  2010    NaN
3  English Learning     Intermediate  2013    NaN
4               A.I         Progress  2019    NaN

In [55]:
Data_person["Passes"]

0              Matric
1               Inter
2               B.com
3    English Learning
4                 A.I
Name: Passes, dtype: object

In [56]:
Data_person.loc[0]

Passes    Matric
Grade          c
Year        2000
Number       NaN
Name: 0, dtype: object

In [57]:
Data_person.loc[3]

Passes    English Learning
Grade         Intermediate
Year                  2013
Number                 NaN
Name: 3, dtype: object

In [58]:
import numpy as np
import pandas as pd

In [59]:
frame = frame = pd.DataFrame(np.random.randn(4,3),columns=list("bde"),index = ["Love","Hate","care","Cute"])
print(frame)

             b         d         e
Love  2.067265 -0.347743 -1.104366
Hate  0.152576 -0.028911 -0.662186
care  0.625018 -0.831820 -0.241440
Cute  0.362167  0.232641  0.759038

In [60]:
frame = (np.abs(frame))
print(frame)

             b         d         e
Love  2.067265  0.347743  1.104366
Hate  0.152576  0.028911  0.662186
care  0.625018  0.831820  0.241440
Cute  0.362167  0.232641  0.759038

In [61]:
frame["d"].min()

0.02891054306845192

In [62]:
frame["d"].max()

0.8318200897826921

In [63]:
frame["d"].min() - frame["d"].max()

-0.8029095467142402

In [64]:
f= lambda x:x.max()-x.min()
print(f)

<function <lambda> at 0x0000000008DDE950>

In [65]:
fd= frame.apply(f)
print(fd)

b    1.914689
d    0.802910
e    0.862926
dtype: float64

In [66]:
frame.apply(f,axis = 1)

Love    1.719522
Hate    0.633276
care    0.590380
Cute    0.526397
dtype: float64

In [67]:
def min_max(x):
    minumum=x.min()
    maximum=x.max()
    return pd.Series([minumum,maximum()],index = ["min","max"])

In [74]:
data_df = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index=["Lahore","Karachi","Punjab","Kashmir"],
                     columns=["One","Two","Three","Four"])

In [75]:
data_df

         One  Two  Three  Four
Lahore     0    1      2     3
Karachi    4    5      6     7
Punjab     8    9     10    11
Kashmir   12   13     14    15

In [77]:
print(data_df.loc["Lahore",["Two","Three"]])

Two      1
Three    2
Name: Lahore, dtype: int32

In [78]:
print(data_df.iloc[1,[2,3,0]])

Three    6
Four     7
One      4
Name: Karachi, dtype: int32

In [82]:
print(data_df.iloc[1:,:2])

         One  Two
Karachi    4    5
Punjab     8    9
Kashmir   12   13

In [97]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),
                   columns=list("bde"),
                   index=["Karachi","Lahore","Islamabad",])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                   columns=list("abc"),
                   index=["Kashmir","Karachi","Hyderabad","Multan"])
print(df1)
print(df2)

             b    d    e
Karachi    0.0  1.0  2.0
Lahore     3.0  4.0  5.0
Islamabad  6.0  7.0  8.0
             a     b     c
Kashmir    0.0   1.0   2.0
Karachi    3.0   4.0   5.0
Hyderabad  6.0   7.0   8.0
Multan     9.0  10.0  11.0

In [99]:
df3 = df1 + df2
print(df3)

            a    b   c   d   e
Hyderabad NaN  NaN NaN NaN NaN
Islamabad NaN  NaN NaN NaN NaN
Karachi   NaN  4.0 NaN NaN NaN
Kashmir   NaN  NaN NaN NaN NaN
Lahore    NaN  NaN NaN NaN NaN
Multan    NaN  NaN NaN NaN NaN

In [101]:
df3=df1.add(df2,fill_value=0)
print(df3)

             a     b     c    d    e
Hyderabad  6.0   7.0   8.0  NaN  NaN
Islamabad  NaN   6.0   NaN  7.0  8.0
Karachi    3.0   4.0   5.0  1.0  2.0
Kashmir    0.0   1.0   2.0  NaN  NaN
Lahore     NaN   3.0   NaN  4.0  5.0
Multan     9.0  10.0  11.0  NaN  NaN

In [102]:
Year = [2000,2004,2010,2013,2019]
Passes = ["Matric","Inter","B.com","English Learning","A.I"]
Grade = ["c","B","second Division","Intermediate","Progress"]
Result ={"Year":Year, "Passes":Passes, "Grade":Grade}
Data_person = pd.DataFrame(Result)
print(Data_person)

   Year            Passes            Grade
0  2000            Matric                c
1  2004             Inter                B
2  2010             B.com  second Division
3  2013  English Learning     Intermediate
4  2019               A.I         Progress

In [103]:
Data_person.index= ["1st","2nd","3rd","4th","5th"]
print(Data_person)

     Year            Passes            Grade
1st  2000            Matric                c
2nd  2004             Inter                B
3rd  2010             B.com  second Division
4th  2013  English Learning     Intermediate
5th  2019               A.I         Progress

In [115]:
Data_person=pd.DataFrame(Result, columns = ["Passes","Grade","Year","Number"])

In [118]:
ln = (len(Data_person))
print(Data_person)
rng = np.arange(ln)
print(rng)
Data_person["Number"]=rng

             Passes            Grade  Year  Number
0            Matric                c  2000       0
1             Inter                B  2004       1
2             B.com  second Division  2010       2
3  English Learning     Intermediate  2013       3
4               A.I         Progress  2019       4
[0 1 2 3 4]

In [123]:
val = pd.Series([1.5,2.5,3.5,2.4,1.5],index = [0,1,2,3,4])
Data_person["Number"]=val
print(Data_person)

             Passes            Grade  Year  Number
0            Matric                c  2000     1.5
1             Inter                B  2004     2.5
2             B.com  second Division  2010     3.5
3  English Learning     Intermediate  2013     2.4
4               A.I         Progress  2019     1.5

In [124]:
Data_person["Number"]=6.5
print(Data_person)

             Passes            Grade  Year  Number
0            Matric                c  2000     6.5
1             Inter                B  2004     6.5
2             B.com  second Division  2010     6.5
3  English Learning     Intermediate  2013     6.5
4               A.I         Progress  2019     6.5

In [125]:
data_df

         One  Two  Three  Four
Lahore     0    1      2     3
Karachi    4    5      6     7
Punjab     8    9     10    11
Kashmir   12   13     14    15

In [129]:
data_df = data_df.drop("Two",axis=1)
data_df

         One  Three  Four
Lahore     0      2     3
Karachi    4      6     7
Punjab     8     10    11
Kashmir   12     14    15